## Series

In [1]:
import pandas as pd

In [20]:
my_list=[1,2,3,4,5]
series_data=pd.Series(my_list)
index_data=pd.Series(my_list,index=["A","B","C","D","E"])
series_data

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [21]:
index_data

A    1
B    2
C    3
D    4
E    5
dtype: int64

series_data

In [3]:
my_dict={"name":"dhibi","age":6}
series_data=pd.Series(my_dict)
series_data

name    dhibi
age         6
dtype: object

## Data Frame

In [4]:
my_dict={"course":["c","java","python"],"fees":[1000,2000,30000]}
data=pd.DataFrame(my_dict)
data

   course   fees
0       c   1000
1    java   2000
2  python  30000

In [5]:
data=pd.DataFrame(my_dict,index=["day1","day2","day3"])
data

      course   fees
day1       c   1000
day2    java   2000
day3  python  30000

In [6]:
data["place"]=["cuddalore","chennai","pudhucherry"]
data

      course   fees        place
day1       c   1000    cuddalore
day2    java   2000      chennai
day3  python  30000  pudhucherry

In [7]:
data.drop("place",axis=1)
data

      course   fees        place
day1       c   1000    cuddalore
day2    java   2000      chennai
day3  python  30000  pudhucherry

In [8]:
# Inplace= True

In [9]:
data.drop("place",axis=1,inplace=True)

In [10]:
# loc-location

In [11]:
data.loc["day2"]

course    java
fees      2000
Name: day2, dtype: object

In [12]:
data.iloc[0]

course       c
fees      1000
Name: day1, dtype: object

In [13]:
data.loc["day2","course"]

'java'

In [14]:
 # Index reset

In [15]:
data.reset_index()

  index  course   fees
0  day1       c   1000
1  day2    java   2000
2  day3  python  30000

In [16]:
data=[2,4,8,12,32,55,-2,-4,87,54,23]
data=pd.DataFrame(data)
data

     0
0    2
1    4
2    8
3   12
4   32
5   55
6   -2
7   -4
8   87
9   54
10  23

In [17]:
data>0

        0
0    True
1    True
2    True
3    True
4    True
5    True
6   False
7   False
8    True
9    True
10   True

In [22]:
my_dict={"course":["c","c++","java"],"fees":[2000,5000,8000]}
data=pd.DataFrame(my_dict)
data

  course  fees
0      c  2000
1    c++  5000
2   java  8000

In [24]:
data=pd.DataFrame(my_dict,index=["day1","day2","day3"])
data

     course  fees
day1      c  2000
day2    c++  5000
day3   java  8000

In [26]:
data["place"]=["Cuddalore","Trichy","Perambalore"]
data

     course  fees        place
day1      c  2000    Cuddalore
day2    c++  5000       Trichy
day3   java  8000  Perambalore